app/controllers/user_controller.rb

SELECT "posts".* FROM "posts"
---
	def user
		@users=Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	def show
		@user=Post.find_by(id:params[:id])

INSERT INTO "posts" ("user", "created_at", "updated_at") VALUES (?, ?, ?)  [["user", "asd"], ["created_at", "2022-10-12 15:21:11.203348"], ["updated_at", "2022-10-12 15:21:11.203348"]]
---
	def create
		@user=Post.new(user:params[:user])
		 if @user.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	def edit
		@user=Post.find_by(id: params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "posts" SET "user" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["user", "D1nast1"], ["updated_at", "2022-10-12 15:33:07.050029"], ["id", 1]]
---
	def update
		@user = Post.find_by(id: params[:id])
		@user.user = params[:user]
		if @user.save